       IDENTIFICATION DIVISION.
       PROGRAM-ID. SELF-KILL.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PID PIC 9(10).
       01 WS-PID-CHAR PIC X(10).
       01 WS-COMMAND PIC X(50).

       PROCEDURE DIVISION.

           CALL "C$GETPID" RETURNING WS-PID.

           MOVE WS-PID TO WS-PID-CHAR.

           STRING "kill -9 " DELIMITED BY SIZE
                  WS-PID-CHAR DELIMITED BY SPACE
                  INTO WS-COMMAND.
           CALL "SYSTEM" USING WS-COMMAND.

           STOP RUN.

       END PROGRAM SELF-KILL.
